# 1759870
# 9870
# 590
# money = input("금액을 입력하세요.")
# money_length = len(money)
# num_money = int(money)
# total = 0
# if money_length > 5:
#   total += num_money//50000
#   + (num_money%50000)//10000
# if money_length > 4:
#   total += ((num_money%50000)%10000)//5000
#   + (((num_money%50000)%10000)%5000)//1000
# if money_length > 3:
#   total += ((((num_money%50000)%10000)%5000)%1000)//500
#   + (((((num_money%50000)%10000)%5000)%1000)%500)//100
# if money_length > 2:
#   total += ((((((num_money%50000)%10000)%5000)%1000)%500)%100)//50
#   + (((((((num_money%50000)%10000)%5000)%1000)%500)%100)%50)//10

# print(total)

# str1 = input("문자를 입력하세요.")
# a = len(str1) # 문자의 길이 .length

# if a==5:
#   print("a는 5입니다.")
# elif a==4:  # else if
#   print("a는 4입니다.")
# elif a==3:
#   print("a는 3입니다.")
# else:
#   print("a 숫자는 2이하입니다.")



# money = 1759870
# # 50000,10000,5000,1000,500,100,50,10
# print("50000원 개수",money//50000, sep='\t:\t')
# print("10000원 개수",(money%50000)//10000, sep='\t:\t')
# print("5000원 개수",((money%50000)%10000)//5000, sep='\t:\t')
# print("1000원 개수",(((money%50000)%10000)%5000)//1000, sep='\t:\t')
# print("500원 개수",((((money%50000)%10000)%5000)%1000)//500, sep='\t:\t')
# print("100원 개수",(((((money%50000)%10000)%5000)%1000)%500)//100, sep='\t:\t')
# print("50원 개수",((((((money%50000)%10000)%5000)%1000)%500)%100)//50, sep='\t:\t')
# print("10원 개수",(((((((money%50000)%10000)%5000)%1000)%500)%100)%50)//10, sep='\t:\t')

# money = 780
# # 500 - 1
# print("500원 동전개수 :",money//500)
# # 100 - 2
# print("100원 동전개수 :",(money%500)//100)
# # 50 - 1
# print("50원 동전개수 :",((money%500)%100)//50)
# # 10 - 3
# print("10원 동전개수 :",(((money%500)%100)%50)//10)
